app/controllers/authenticates_controller.rb

    def login
        params = params_login

        @user = User.find_by_username(params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]